## **Lesson 1: Getting started with pandas**

In [1]:
import numpy as np
import pandas as pd

In [ ]:
# Series: Population by Country Code
country_population = pd.Series(
    data=[61, 46, 11, 65, 10],
    index=["IT", "ES", "GR", "FR", "PO"],
    name="Country Population"
)

data = {"Name": ["Avery Bradley", "John Holland", "Jonas Jerebko",
    "Jordan Mickey", "Terry Rozier", "Jared Sullinger", "Evan Turner"],
    "Team": ["Boston Celtics"] * 7,
    "Number": [0.0, 30.0, 8.0, None, 12.0, 7.0, 11.0],
    "Position": ["PG", "SG", "PF", "PF", "PG", "C", "SG"],
    "Age": [25.0, 27.0, 29.0, 21.0, 22.0, None, 27.0]
}
df_0 = pd.DataFrame(data)

In [3]:
country_population

IT    61
ES    46
GR    11
FR    65
PO    10
Name: Country Population, dtype: int64

In [4]:
df_0

              Name            Team  Number Position   Age
0    Avery Bradley  Boston Celtics     0.0       PG  25.0
1     John Holland  Boston Celtics    30.0       SG  27.0
2    Jonas Jerebko  Boston Celtics     8.0       PF  29.0
3    Jordan Mickey  Boston Celtics     NaN       PF  21.0
4     Terry Rozier  Boston Celtics    12.0       PG  22.0
5  Jared Sullinger  Boston Celtics     7.0        C   NaN
6      Evan Turner  Boston Celtics    11.0       SG  27.0

In [5]:
country_population.index

Index(['IT', 'ES', 'GR', 'FR', 'PO'], dtype='object')

In [6]:
country_population.values

array([61, 46, 11, 65, 10])

In [7]:
country_population.shape

(5,)

In [9]:
df_0

              Name            Team  Number Position   Age
0    Avery Bradley  Boston Celtics     0.0       PG  25.0
1     John Holland  Boston Celtics    30.0       SG  27.0
2    Jonas Jerebko  Boston Celtics     8.0       PF  29.0
3    Jordan Mickey  Boston Celtics     NaN       PF  21.0
4     Terry Rozier  Boston Celtics    12.0       PG  22.0
5  Jared Sullinger  Boston Celtics     7.0        C   NaN
6      Evan Turner  Boston Celtics    11.0       SG  27.0

In [8]:
df_0.index

RangeIndex(start=0, stop=7, step=1)

In [10]:
df_0.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age'], dtype='object')

In [11]:
df_0.values

array([['Avery Bradley', 'Boston Celtics', 0.0, 'PG', 25.0],
       ['John Holland', 'Boston Celtics', 30.0, 'SG', 27.0],
       ['Jonas Jerebko', 'Boston Celtics', 8.0, 'PF', 29.0],
       ['Jordan Mickey', 'Boston Celtics', nan, 'PF', 21.0],
       ['Terry Rozier', 'Boston Celtics', 12.0, 'PG', 22.0],
       ['Jared Sullinger', 'Boston Celtics', 7.0, 'C', nan],
       ['Evan Turner', 'Boston Celtics', 11.0, 'SG', 27.0]], dtype=object)

In [12]:
df_0.shape

(7, 5)

In [13]:
type(country_population)

pandas.core.series.Series

In [16]:
df_0

              Name            Team  Number Position   Age
0    Avery Bradley  Boston Celtics     0.0       PG  25.0
1     John Holland  Boston Celtics    30.0       SG  27.0
2    Jonas Jerebko  Boston Celtics     8.0       PF  29.0
3    Jordan Mickey  Boston Celtics     NaN       PF  21.0
4     Terry Rozier  Boston Celtics    12.0       PG  22.0
5  Jared Sullinger  Boston Celtics     7.0        C   NaN
6      Evan Turner  Boston Celtics    11.0       SG  27.0

In [17]:
df_0.Name

0      Avery Bradley
1       John Holland
2      Jonas Jerebko
3      Jordan Mickey
4       Terry Rozier
5    Jared Sullinger
6        Evan Turner
Name: Name, dtype: object

In [18]:
type(df_0.Name)

pandas.core.series.Series

In [19]:
df_0.iloc[0]

Name         Avery Bradley
Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Name: 0, dtype: object

In [20]:
type(df_0.iloc[0])

pandas.core.series.Series

In [21]:
# Create a Series from a list
s1 = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
# Create a Series from a dictionary
s2 = pd.Series({'Hanoi': 1000, 'HCMC': 2000})

In [22]:
s1

a    10
b    20
c    30
dtype: int64

In [24]:
s1[2]

C:\Users\Admin\AppData\Local\Temp\ipykernel_11884\715705533.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s1[2]

np.int64(30)

In [25]:
s1['c']

np.int64(30)

In [26]:
data = {'Province': ['Hanoi', 'HCMC', 'Danang'],
        'Population (millions)': [8.05, 8.99, 1.13]}
df = pd.DataFrame(data)
df

  Province  Population (millions)
0    Hanoi                   8.05
1     HCMC                   8.99
2   Danang                   1.13

In [27]:
ind = df.index
type(ind)

pandas.core.indexes.range.RangeIndex

In [28]:
indc = df.columns
type(indc)

pandas.core.indexes.base.Index

In [29]:
ind[0] = 1000  # This will raise an error because index is immutable

TypeError: Index does not support mutable operations

In [30]:
indc

Index(['Province', 'Population (millions)'], dtype='object')

In [31]:
indc[2] = 'New Column'  # This will raise an error because columns are immutable

TypeError: Index does not support mutable operations

In [32]:
indc

Index(['Province', 'Population (millions)'], dtype='object')

In [34]:
indc_ex = indc.union({"New Column "})
indc_ex

Index(['New Column ', 'Population (millions)', 'Province'], dtype='object')

In [35]:
df

  Province  Population (millions)
0    Hanoi                   8.05
1     HCMC                   8.99
2   Danang                   1.13

In [37]:
df.reindex(index=[1,2,3], fill_value=0)  # Reindexing with fill_value

  Province  Population (millions)
1     HCMC                   8.99
2   Danang                   1.13
3        0                   0.00

In [40]:
df_newc = df.reindex(columns=indc_ex, fill_value=0)  # Reindexing with new columns
df_newc

   New Column   Population (millions) Province
0            0                   8.05    Hanoi
1            0                   8.99     HCMC
2            0                   1.13   Danang

In [39]:
df

  Province  Population (millions)
0    Hanoi                   8.05
1     HCMC                   8.99
2   Danang                   1.13

In [41]:
df_newc.drop(columns=['New Column '])  # Dropping the new column

   Population (millions) Province
0                   8.05    Hanoi
1                   8.99     HCMC
2                   1.13   Danang

In [43]:
df_newc.drop('New Column ', axis=1)  # Another way to drop the column
df_newc

   New Column   Population (millions) Province
0            0                   8.05    Hanoi
1            0                   8.99     HCMC
2            0                   1.13   Danang

In [44]:
df_newc.drop(columns=['New Column '], inplace=True)  # Dropping the new column
df_newc

   Population (millions) Province
0                   8.05    Hanoi
1                   8.99     HCMC
2                   1.13   Danang

In [45]:
df_newc.drop(0)

   Population (millions) Province
1                   8.99     HCMC
2                   1.13   Danang

In [46]:
df_newc

   Population (millions) Province
0                   8.05    Hanoi
1                   8.99     HCMC
2                   1.13   Danang

In [47]:
df_newc.drop(2,inplace=True)  # Dropping the row with index 2
df_newc

   Population (millions) Province
0                   8.05    Hanoi
1                   8.99     HCMC

In [48]:
df

  Province  Population (millions)
0    Hanoi                   8.05
1     HCMC                   8.99
2   Danang                   1.13

In [49]:
df.Province

0     Hanoi
1      HCMC
2    Danang
Name: Province, dtype: object

In [50]:
df.Population (millions)

AttributeError: 'DataFrame' object has no attribute 'Population'

In [51]:
df['Population (millions)']

0    8.05
1    8.99
2    1.13
Name: Population (millions), dtype: float64

In [53]:
df['Province']

0     Hanoi
1      HCMC
2    Danang
Name: Province, dtype: object

In [54]:
df_0

              Name            Team  Number Position   Age
0    Avery Bradley  Boston Celtics     0.0       PG  25.0
1     John Holland  Boston Celtics    30.0       SG  27.0
2    Jonas Jerebko  Boston Celtics     8.0       PF  29.0
3    Jordan Mickey  Boston Celtics     NaN       PF  21.0
4     Terry Rozier  Boston Celtics    12.0       PG  22.0
5  Jared Sullinger  Boston Celtics     7.0        C   NaN
6      Evan Turner  Boston Celtics    11.0       SG  27.0

In [55]:
df_0[['Name', 'Team']]

              Name            Team
0    Avery Bradley  Boston Celtics
1     John Holland  Boston Celtics
2    Jonas Jerebko  Boston Celtics
3    Jordan Mickey  Boston Celtics
4     Terry Rozier  Boston Celtics
5  Jared Sullinger  Boston Celtics
6      Evan Turner  Boston Celtics

In [56]:
df_0

              Name            Team  Number Position   Age
0    Avery Bradley  Boston Celtics     0.0       PG  25.0
1     John Holland  Boston Celtics    30.0       SG  27.0
2    Jonas Jerebko  Boston Celtics     8.0       PF  29.0
3    Jordan Mickey  Boston Celtics     NaN       PF  21.0
4     Terry Rozier  Boston Celtics    12.0       PG  22.0
5  Jared Sullinger  Boston Celtics     7.0        C   NaN
6      Evan Turner  Boston Celtics    11.0       SG  27.0

In [58]:
df_01 = df_0.set_index('Name')  # Setting 'Name' as the index
df_01

                           Team  Number Position   Age
Name
Avery Bradley    Boston Celtics     0.0       PG  25.0
John Holland     Boston Celtics    30.0       SG  27.0
Jonas Jerebko    Boston Celtics     8.0       PF  29.0
Jordan Mickey    Boston Celtics     NaN       PF  21.0
Terry Rozier     Boston Celtics    12.0       PG  22.0
Jared Sullinger  Boston Celtics     7.0        C   NaN
Evan Turner      Boston Celtics    11.0       SG  27.0

In [59]:
df_01.index

Index(['Avery Bradley', 'John Holland', 'Jonas Jerebko', 'Jordan Mickey',
       'Terry Rozier', 'Jared Sullinger', 'Evan Turner'],
      dtype='object', name='Name')

In [60]:
df_01

                           Team  Number Position   Age
Name
Avery Bradley    Boston Celtics     0.0       PG  25.0
John Holland     Boston Celtics    30.0       SG  27.0
Jonas Jerebko    Boston Celtics     8.0       PF  29.0
Jordan Mickey    Boston Celtics     NaN       PF  21.0
Terry Rozier     Boston Celtics    12.0       PG  22.0
Jared Sullinger  Boston Celtics     7.0        C   NaN
Evan Turner      Boston Celtics    11.0       SG  27.0

In [61]:
df_01.loc['Avery Bradley']  # Accessing a row by index label

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Name: Avery Bradley, dtype: object

In [63]:
df_01

                           Team  Number Position   Age
Name
Avery Bradley    Boston Celtics     0.0       PG  25.0
John Holland     Boston Celtics    30.0       SG  27.0
Jonas Jerebko    Boston Celtics     8.0       PF  29.0
Jordan Mickey    Boston Celtics     NaN       PF  21.0
Terry Rozier     Boston Celtics    12.0       PG  22.0
Jared Sullinger  Boston Celtics     7.0        C   NaN
Evan Turner      Boston Celtics    11.0       SG  27.0

In [64]:
df_01.loc['Avery Bradley':'Jonas Jerebko']

                         Team  Number Position   Age
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0
John Holland   Boston Celtics    30.0       SG  27.0
Jonas Jerebko  Boston Celtics     8.0       PF  29.0

In [65]:
df_01.iloc[0]

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Name: Avery Bradley, dtype: object

In [66]:
df_01.iloc[0:3]  # Accessing rows by integer location

                         Team  Number Position   Age
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0
John Holland   Boston Celtics    30.0       SG  27.0
Jonas Jerebko  Boston Celtics     8.0       PF  29.0

In [67]:
df

  Province  Population (millions)
0    Hanoi                   8.05
1     HCMC                   8.99
2   Danang                   1.13

In [68]:
df.drop(0, inplace=True)  # Dropping the first row
df

  Province  Population (millions)
1     HCMC                   8.99
2   Danang                   1.13

In [69]:
df.loc[1]

Province                 HCMC
Population (millions)    8.99
Name: 1, dtype: object

In [70]:
df.iloc[1]

Province                 Danang
Population (millions)      1.13
Name: 2, dtype: object

In [71]:
df_01

                           Team  Number Position   Age
Name
Avery Bradley    Boston Celtics     0.0       PG  25.0
John Holland     Boston Celtics    30.0       SG  27.0
Jonas Jerebko    Boston Celtics     8.0       PF  29.0
Jordan Mickey    Boston Celtics     NaN       PF  21.0
Terry Rozier     Boston Celtics    12.0       PG  22.0
Jared Sullinger  Boston Celtics     7.0        C   NaN
Evan Turner      Boston Celtics    11.0       SG  27.0

In [72]:
df_01.loc['John Holland','Number']

np.float64(30.0)

In [73]:
df_01.iloc[1,1]

np.float64(30.0)

In [74]:
df_01.loc['Jordan Mickey':"Terry Rozier",'Number':"Position"]

               Number Position
Name
Jordan Mickey     NaN       PF
Terry Rozier     12.0       PG

In [75]:
df_01.iloc[3:5, 1:3]  # Accessing a range of rows and columns by integer location

               Number Position
Name
Jordan Mickey     NaN       PF
Terry Rozier     12.0       PG

In [76]:
df

  Province  Population (millions)
1     HCMC                   8.99
2   Danang                   1.13

In [77]:
df_0

              Name            Team  Number Position   Age
0    Avery Bradley  Boston Celtics     0.0       PG  25.0
1     John Holland  Boston Celtics    30.0       SG  27.0
2    Jonas Jerebko  Boston Celtics     8.0       PF  29.0
3    Jordan Mickey  Boston Celtics     NaN       PF  21.0
4     Terry Rozier  Boston Celtics    12.0       PG  22.0
5  Jared Sullinger  Boston Celtics     7.0        C   NaN
6      Evan Turner  Boston Celtics    11.0       SG  27.0

In [78]:
df_0["Position"]=='SG'

0    False
1     True
2    False
3    False
4    False
5    False
6     True
Name: Position, dtype: bool

In [79]:
df_0[df_0["Position"]=='SG']

           Name            Team  Number Position   Age
1  John Holland  Boston Celtics    30.0       SG  27.0
6   Evan Turner  Boston Celtics    11.0       SG  27.0

In [ ]:
df_0[df_0["Position"]!='SG']

              Name            Team  Number Position   Age
0    Avery Bradley  Boston Celtics     0.0       PG  25.0
2    Jonas Jerebko  Boston Celtics     8.0       PF  29.0
3    Jordan Mickey  Boston Celtics     NaN       PF  21.0
4     Terry Rozier  Boston Celtics    12.0       PG  22.0
5  Jared Sullinger  Boston Celtics     7.0        C   NaN

In [82]:
df_0[~(df_0["Position"]=='SG')]  # Using the bitwise NOT operator to filter rows

              Name            Team  Number Position   Age
0    Avery Bradley  Boston Celtics     0.0       PG  25.0
2    Jonas Jerebko  Boston Celtics     8.0       PF  29.0
3    Jordan Mickey  Boston Celtics     NaN       PF  21.0
4     Terry Rozier  Boston Celtics    12.0       PG  22.0
5  Jared Sullinger  Boston Celtics     7.0        C   NaN

In [83]:
import seaborn as sns 
df_lab0 = sns.load_dataset("titanic").head(10)  # Load the Titanic dataset
df_lab0

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [84]:
drop_columns = ['pclass','alive','embarked','embarked']
df_lab0.drop(columns=drop_columns, inplace=True)  # Dropping specified columns
df_lab0

,survived,sex,age,sibsp,parch,fare,class,who,adult_male,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,man,True,NaN,Southampton,False
1,1,female,38.0,1,0,71.2833,First,woman,False,C,Cherbourg,False
2,1,female,26.0,0,0,7.9250,Third,woman,False,NaN,Southampton,True
3,1,female,35.0,1,0,53.1000,First,woman,False,C,Southampton,False
4,0,male,35.0,0,0,8.0500,Third,man,True,NaN,Southampton,True
5,0,male,NaN,0,0,8.4583,Third,man,True,NaN,Queenstown,True
6,0,male,54.0,0,0,51.8625,First,man,True,E,Southampton,True
7,0,male,2.0,3,1,21.0750,Third,child,False,NaN,Southampton,False
8,1,female,27.0,0,2,11.1333,Third,woman,False,NaN,Southampton,False
9,1,female,14.0,1,0,30.0708,Second,child,False,NaN,Cherbourg,False

In [86]:
mask = df_lab0['sex']=='male' 
df_lab0[mask]  # Filtering rows where

,survived,sex,age,sibsp,parch,fare,class,who,adult_male,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,man,True,NaN,Southampton,False
4,0,male,35.0,0,0,8.0500,Third,man,True,NaN,Southampton,True
5,0,male,NaN,0,0,8.4583,Third,man,True,NaN,Queenstown,True
6,0,male,54.0,0,0,51.8625,First,man,True,E,Southampton,True
7,0,male,2.0,3,1,21.0750,Third,child,False,NaN,Southampton,False

In [87]:
df_lab0[~mask]

,survived,sex,age,sibsp,parch,fare,class,who,adult_male,deck,embark_town,alone
1,1,female,38.0,1,0,71.2833,First,woman,False,C,Cherbourg,False
2,1,female,26.0,0,0,7.9250,Third,woman,False,NaN,Southampton,True
3,1,female,35.0,1,0,53.1000,First,woman,False,C,Southampton,False
8,1,female,27.0,0,2,11.1333,Third,woman,False,NaN,Southampton,False
9,1,female,14.0,1,0,30.0708,Second,child,False,NaN,Cherbourg,False

In [88]:
df_lab0[df_lab0['adult_male']]

,survived,sex,age,sibsp,parch,fare,class,who,adult_male,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,man,True,NaN,Southampton,False
4,0,male,35.0,0,0,8.0500,Third,man,True,NaN,Southampton,True
5,0,male,NaN,0,0,8.4583,Third,man,True,NaN,Queenstown,True
6,0,male,54.0,0,0,51.8625,First,man,True,E,Southampton,True

In [93]:
df_lab0[mask]['survived'].sum()/df_lab0.shape[0]  # Calculating the survival rate for

np.float64(0.0)

In [92]:
df_lab0.shape

(10, 12)

In [94]:
df_lab0[~mask]['survived'].sum()/df_lab0.shape[0]

np.float64(0.5)